# Introduction to Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
employee_fields=['Employee Name','Employee Designation','Employee ID']
employee_data=['Arnold','Manager','1234']

In [3]:
employee=pd.Series(index=employee_fields,data=employee_data)

In [4]:
employee

Employee Name            Arnold
Employee Designation    Manager
Employee ID                1234
dtype: object

In [5]:
countries_series={'Afghanistan':'Kabul',
                 'India':'Delhi',
                 'Russia':'Moscow',
                 'China':'Beijing',
                 'England':'London',
                 'France':'Paris'}
countries_series

{'Afghanistan': 'Kabul',
 'India': 'Delhi',
 'Russia': 'Moscow',
 'China': 'Beijing',
 'England': 'London',
 'France': 'Paris'}

In [6]:
country=pd.Series(countries_series)

In [7]:
country

Afghanistan      Kabul
India            Delhi
Russia          Moscow
China          Beijing
England         London
France           Paris
dtype: object

In [8]:
country[1:5]

India        Delhi
Russia      Moscow
China      Beijing
England     London
dtype: object

# DATAFRAMES
# Columns can be of different data types:
# 1. Labelled axes
# 2. Can add columns to Dataframes
# 3. Can perform arithmetic operations on columns and rows
# Can be of different data types:
# 1. Lists
# 2. Dictionaries
# 3. Series
# 4. Numpy Arrays
# 5. Another data frame

In [9]:
countries=['India','USA','Japan','Germany','Italy']
political_figures=['Jawaharlal Nehru','Franklin D Roosevelt','Hideki Tojo','Adolf Hitler','Benito Mussolini']
politician_tuples=list(zip(political_figures,countries))

In [10]:
politicians_df=pd.DataFrame(politician_tuples)

In [11]:
politicians_df

                      0        1
0      Jawaharlal Nehru    India
1  Franklin D Roosevelt      USA
2           Hideki Tojo    Japan
3          Adolf Hitler  Germany
4      Benito Mussolini    Italy

In [12]:
politicians_df=pd.DataFrame(politician_tuples,columns=['Political Leaders','Countries'],index=[1,2,3,4,5])
politicians_df

      Political Leaders Countries
1      Jawaharlal Nehru     India
2  Franklin D Roosevelt       USA
3           Hideki Tojo     Japan
4          Adolf Hitler   Germany
5      Benito Mussolini     Italy

In [13]:
politician_dict={'countries':np.array(countries),
                'Politician Name':np.array(political_figures)}
pd.DataFrame(politician_dict)

  countries       Politician Name
0     India      Jawaharlal Nehru
1       USA  Franklin D Roosevelt
2     Japan           Hideki Tojo
3   Germany          Adolf Hitler
4     Italy      Benito Mussolini

In [14]:
pd.Series(countries)

0      India
1        USA
2      Japan
3    Germany
4      Italy
dtype: object

# Load Data into a DataFrame

In [15]:
politicians_df.to_csv('C:/Destination/Politicians.csv')

In [16]:
df=pd.read_csv('C:/countries/countries of the world.csv')

In [17]:
df

,Country,Region,Population,Area (sq. mi.),Pop. Density (per sq. mi.),Coastline (coast/area ratio),Net migration,Infant mortality (per 1000 births),GDP ($ per capita),Literacy (%),Phones (per 1000),Arable (%),Crops (%),Other (%),Climate,Birthrate,Deathrate,Agriculture,Industry,Service
0,Afghanistan,ASIA (EX. NEAR EAST),31056997,647500,"48,0","0,00","23,06","163,07",700.0,"36,0","3,2","12,13","0,22","87,65",1,"46,6","20,34","0,38","0,24","0,38"
1,Albania,EASTERN EUROPE,3581655,28748,"124,6","1,26","-4,93","21,52",4500.0,"86,5","71,2","21,09","4,42","74,49",3,"15,11","5,22","0,232","0,188","0,579"
2,Algeria,NORTHERN AFRICA,32930091,2381740,"13,8","0,04","-0,39",31,6000.0,"70,0","78,1","3,22","0,25","96,53",1,"17,14","4,61","0,101","0,6","0,298"
3,American Samoa,OCEANIA,57794,199,"290,4","58,29","-20,71","9,27",8000.0,"97,0","259,5",10,15,75,2,"22,46","3,27",NaN,NaN,NaN
4,Andorra,WESTERN EUROPE,71201,468,"152,1","0,00","6,6","4,05",19000.0,"100,0","497,2","2,22",0,"97,78",3,"8,71","6,25",NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
222,West Bank,NEAR EAST,2460492,5860,"419,9","0,00","2,98","19,62",800.0,NaN,"145,2","16,9","18,97","64,13",3,"31,67","3,92","0,09","0,28","0,63"
223,Western Sahara,NORTHERN AFRICA,273008,266000,"1,0","0,42",NaN,NaN,NaN,NaN,NaN,"0,02",0,"99,98",1,NaN,NaN,NaN,NaN,"0,4"
224,Yemen,NEAR EAST,21456188,527970,"40,6","0,36",0,"61,5",800.0,"50,2","37,2","2,78","0,24","96,98",1,"42,89","8,3","0,135","0,472","0,393"
225,Zambia,SUB-SAHARAN AFRICA,11502010,752614,"15,3","0,00",0,"88,29",800.0,"80,6","8,2","7,08","0,03","92,9",2,41,"19,93","0,22","0,29","0,489"
226,Zimbabwe,SUB-SAHARAN AFRICA,12236805,390580,"31,3","0,00",0,"67,69",1900.0,"90,7","26,8","8,32","0,34","91,34",2,"28,01","21,84","0,179","0,243","0,579"

# ADD AND DELETE

In [18]:
politicians_df['Year Of Birth']=['1900','1901','1902','1903','1904']  #Adding new column

In [19]:
politicians_df

      Political Leaders Countries Year Of Birth
1      Jawaharlal Nehru     India          1900
2  Franklin D Roosevelt       USA          1901
3           Hideki Tojo     Japan          1902
4          Adolf Hitler   Germany          1903
5      Benito Mussolini     Italy          1904

In [20]:
del politicians_df['Year Of Birth']

In [21]:
politicians_df

      Political Leaders Countries
1      Jawaharlal Nehru     India
2  Franklin D Roosevelt       USA
3           Hideki Tojo     Japan
4          Adolf Hitler   Germany
5      Benito Mussolini     Italy

In [22]:
politicians_df.loc[0]=['Otto Von Bismark','Germany']

In [23]:
politicians_df

      Political Leaders Countries
1      Jawaharlal Nehru     India
2  Franklin D Roosevelt       USA
3           Hideki Tojo     Japan
4          Adolf Hitler   Germany
5      Benito Mussolini     Italy
0      Otto Von Bismark   Germany

In [24]:
politicians_df=politicians_df.sort_index()
politicians_df

      Political Leaders Countries
0      Otto Von Bismark   Germany
1      Jawaharlal Nehru     India
2  Franklin D Roosevelt       USA
3           Hideki Tojo     Japan
4          Adolf Hitler   Germany
5      Benito Mussolini     Italy

In [25]:
politicians_df=politicians_df.drop(politicians_df.index[0])               #deleting row of a Dataframe

In [26]:
politicians_df

      Political Leaders Countries
1      Jawaharlal Nehru     India
2  Franklin D Roosevelt       USA
3           Hideki Tojo     Japan
4          Adolf Hitler   Germany
5      Benito Mussolini     Italy

In [27]:
index_values=['1801','1802','1803','1804','1805']
politicians_df.index=index_values
politicians_df

         Political Leaders Countries
1801      Jawaharlal Nehru     India
1802  Franklin D Roosevelt       USA
1803           Hideki Tojo     Japan
1804          Adolf Hitler   Germany
1805      Benito Mussolini     Italy

In [28]:
politicians_df=politicians_df.reset_index()

In [29]:
politicians_df

  index     Political Leaders Countries
0  1801      Jawaharlal Nehru     India
1  1802  Franklin D Roosevelt       USA
2  1803           Hideki Tojo     Japan
3  1804          Adolf Hitler   Germany
4  1805      Benito Mussolini     Italy

In [30]:
politicians_df=politicians_df.drop(columns=['index'])
politicians_df

      Political Leaders Countries
0      Jawaharlal Nehru     India
1  Franklin D Roosevelt       USA
2           Hideki Tojo     Japan
3          Adolf Hitler   Germany
4      Benito Mussolini     Italy

# Select Parts of Dataframe

In [31]:
towed_cars=pd.read_csv('C:/Destination/Towed_Cars_for_the_Past_30_Days.csv')

In [32]:
towed_cars.head()

,TowNum,Tow_Firm,Tow_Firm_Address,Tow_Firm_Phone,Vehicle_State,Vehicle_Plate,Vehicle_Year,Make,Model,Color,Tow_From_Address,Date,Time,geom
0,390416,"CORONA'S AUTO PARTS,INC.",608 WETHERSFIELD AV. HARTFORD CT. 06114,860-296-5382,CT,AX31928,2003,MAZDA,TRIBUTE,BLUE,1 MAPLETON ST,4292021,1249,"(41.73928425961141, -72.68564556606026)"
1,390873,NaN,NaN,860-296-2826,CT,BA13154,2017,NISSAN,PATHFINDER,SILVER,66 TAYLOR DR,5182021,221,"(41.79532477861001, -72.67949086122226)"
2,390641,NaN,NaN,860-296-2826,CT,AT57018,2018,CHEVY,IMPALA,WHITE,300 ASYLUM ST,5062021,2348,"(41.76758525331148, -72.6785700106631)"
3,390874,NaN,NaN,860-296-2826,CT,AM27652,2020,HONDA,CRV,WHITE,55 TRUMBULL ST,5182021,227,"(41.76544374178968, -72.67653280963901)"
4,390705,CROSS COUNTRY AUTO,"585 WINDOSR ST. HARTFORD, CT 06120",860-296-2826,CT,AW19216,2015,INFINITI,Q50,GRAY,2 BECKET ST,5082021,1547,"(41.73478829173222, -72.68268585663728)"

In [33]:
towed_cars[['Make','Color']].head(9)

       Make   Color
0     MAZDA    BLUE
1    NISSAN  SILVER
2     CHEVY   WHITE
3     HONDA   WHITE
4  INFINITI    GRAY
5       BMW    GRAY
6       BMW    GRAY
7    NISSAN    GRAY
8     HONDA    BLUE

In [34]:
towed_cars.tail(9)

,TowNum,Tow_Firm,Tow_Firm_Address,Tow_Firm_Phone,Vehicle_State,Vehicle_Plate,Vehicle_Year,Make,Model,Color,Tow_From_Address,Date,Time,geom
588,390869,NaN,NaN,860-296-2826,NaN,NaN,2003,HONDA,CIVIC,RED,72 MOUNTFORD ST,5172021,1121,"(41.74211270609412, -72.68661292177609)"
589,390868,NaN,NaN,860-296-2826,CT,AD65810,2002,ACURA,MDX,BLACK,81 VINE ST,5172021,1035,"(41.781853238047375, -72.68905091488475)"
590,390765,CROSS COUNTRY AUTO,"585 WINDOSR ST. HARTFORD, CT 06120",860-296-2826,CT,AZ67191,2010,HONDA,ACCORD,GRAY,166 COLLINS ST,5102021,2125,"(41.77301969624251, -72.69027957677879)"
591,390767,CROSS COUNTRY AUTO,"585 WINDOSR ST. HARTFORD, CT 06120",860-296-2826,CT,AX41014,2020,TOYOTA,COROLLA,GRAY,37 HUNTINGTON ST,5102021,2203,"(41.771689641028985, -72.69195223539661)"
592,390766,CAPITOL TOWING,"181-211 WALNUT ST. HARTFORD, CT. 06120",860-293-2442,CT,9210XY,2012,HONDA,ACCORD,GRY,TOWER AV & WAVERLY ST,5102021,2135,"(90.0, -72.75)"
593,390801,CROSS COUNTRY AUTO,"585 WINDOSR ST. HARTFORD, CT 06120",860-296-2826,CT,429ZXH,1995,TOYOTA,COROLLA,BLUE,282 LAUREL ST,5122021,1542,"(41.766988656846046, -72.69696022167827)"
594,390864,NaN,NaN,860-677-7771,MA,3CX411,2009,NISSAN,ALTIMA,GRAY,270 LAUREL ST,5162021,1318,"(41.76643243554058, -72.69696318633216)"
595,390865,CROSS COUNTRY AUTO,"585 WINDOSR ST. HARTFORD, CT 06120",860-296-2826,CT,AD68872,2004,HONDA,ACCORD,BLACK,5 MARY SHEPARD PL,5162021,1525,"(41.779264108968434, -72.67348009615753)"
596,390866,NaN,NaN,860-296-2826,MA,2GBK55,2014,AUDI,Q5,BLACK,5 MARY SHEPARD PL,5162021,1532,"(41.779264108968434, -72.67348009615753)"

In [35]:
towed_cars.loc[6]

TowNum                                               390870
Tow_Firm                                                NaN
Tow_Firm_Address                                        NaN
Tow_Firm_Phone                                 860-296-2826
Vehicle_State                                            CT
Vehicle_Plate                                       AP79798
Vehicle_Year                                           2008
Make                                                    BMW
Model                                                   328
Color                                                  GRAY
Tow_From_Address                        217 WETHERSFIELD AV
Date                                                5172021
Time                                                   1335
geom                (41.74979521483345, -72.67412888325924)
Name: 6, dtype: object

In [36]:
towed_cars.loc[0:4]

,TowNum,Tow_Firm,Tow_Firm_Address,Tow_Firm_Phone,Vehicle_State,Vehicle_Plate,Vehicle_Year,Make,Model,Color,Tow_From_Address,Date,Time,geom
0,390416,"CORONA'S AUTO PARTS,INC.",608 WETHERSFIELD AV. HARTFORD CT. 06114,860-296-5382,CT,AX31928,2003,MAZDA,TRIBUTE,BLUE,1 MAPLETON ST,4292021,1249,"(41.73928425961141, -72.68564556606026)"
1,390873,NaN,NaN,860-296-2826,CT,BA13154,2017,NISSAN,PATHFINDER,SILVER,66 TAYLOR DR,5182021,221,"(41.79532477861001, -72.67949086122226)"
2,390641,NaN,NaN,860-296-2826,CT,AT57018,2018,CHEVY,IMPALA,WHITE,300 ASYLUM ST,5062021,2348,"(41.76758525331148, -72.6785700106631)"
3,390874,NaN,NaN,860-296-2826,CT,AM27652,2020,HONDA,CRV,WHITE,55 TRUMBULL ST,5182021,227,"(41.76544374178968, -72.67653280963901)"
4,390705,CROSS COUNTRY AUTO,"585 WINDOSR ST. HARTFORD, CT 06120",860-296-2826,CT,AW19216,2015,INFINITI,Q50,GRAY,2 BECKET ST,5082021,1547,"(41.73478829173222, -72.68268585663728)"

In [37]:
towed_cars.loc[9:,'TowNum':'Vehicle_Year']

,TowNum,Tow_Firm,Tow_Firm_Address,Tow_Firm_Phone,Vehicle_State,Vehicle_Plate,Vehicle_Year
9,390876,NaN,NaN,860-296-2826,CT,AX85945,2010
10,390877,EMPIRE MOTORS INC,"57,ST. CLAIR AVE,NEW BRITAIN,CT,99999",860-223-8965,CT,AY82279,2007
11,390878,EMPIRE MOTORS INC,"57,ST. CLAIR AVE,NEW BRITAIN,CT,99999",860-223-8965,NY,GSE6295,2004
12,390346,CROSS COUNTRY AUTO,"585 WINDOSR ST. HARTFORD, CT 06120",860-296-2826,CT,AX31519,2019
13,390279,CROSS COUNTRY TOWING,"100 AIRPORT RD. HARTFORD, CT. 06114",860-296-2826,CT,AX47960,2017
...,...,...,...,...,...,...,...
592,390766,CAPITOL TOWING,"181-211 WALNUT ST. HARTFORD, CT. 06120",860-293-2442,CT,9210XY,2012
593,390801,CROSS COUNTRY AUTO,"585 WINDOSR ST. HARTFORD, CT 06120",860-296-2826,CT,429ZXH,1995
594,390864,NaN,NaN,860-677-7771,MA,3CX411,2009
595,390865,CROSS COUNTRY AUTO,"585 WINDOSR ST. HARTFORD, CT 06120",860-296-2826,CT,AD68872,2004
596,390866,NaN,NaN,860-296-2826,MA,2GBK55,2014

In [38]:
towed_cars.loc[[1,6,16],:]

,TowNum,Tow_Firm,Tow_Firm_Address,Tow_Firm_Phone,Vehicle_State,Vehicle_Plate,Vehicle_Year,Make,Model,Color,Tow_From_Address,Date,Time,geom
1,390873,NaN,NaN,860-296-2826,CT,BA13154,2017,NISSAN,PATHFINDER,SILVER,66 TAYLOR DR,5182021,221,"(41.79532477861001, -72.67949086122226)"
6,390870,NaN,NaN,860-296-2826,CT,AP79798,2008,BMW,328,GRAY,217 WETHERSFIELD AV,5172021,1335,"(41.74979521483345, -72.67412888325924)"
16,390468,CAPITOL TOWING,"181-211 WALNUT ST. HARTFORD, CT. 06120",860-293-2442,CT,BA02637,2020,MERCEDES,E350,WHITE,184 HOMESTEAD AV,5012021,151,"(41.77766507165241, -72.69437250948293)"

In [39]:
towed_cars.iloc[2:6,3:7]

  Tow_Firm_Phone Vehicle_State Vehicle_Plate  Vehicle_Year
2   860-296-2826            CT       AT57018          2018
3   860-296-2826            CT       AM27652          2020
4   860-296-2826            CT       AW19216          2015
5   860-296-2826            CT       AX88287          2001

In [40]:
towed_cars.iloc[[3,5,7],[3,5,7]]

  Tow_Firm_Phone Vehicle_Plate    Make
3   860-296-2826       AM27652   HONDA
5   860-296-2826       AX88287     BMW
7   860-296-5382       AS28437  NISSAN

In [41]:
towed_cars[towed_cars['Vehicle_Year']>2005]

,TowNum,Tow_Firm,Tow_Firm_Address,Tow_Firm_Phone,Vehicle_State,Vehicle_Plate,Vehicle_Year,Make,Model,Color,Tow_From_Address,Date,Time,geom
1,390873,NaN,NaN,860-296-2826,CT,BA13154,2017,NISSAN,PATHFINDER,SILVER,66 TAYLOR DR,5182021,221,"(41.79532477861001, -72.67949086122226)"
2,390641,NaN,NaN,860-296-2826,CT,AT57018,2018,CHEVY,IMPALA,WHITE,300 ASYLUM ST,5062021,2348,"(41.76758525331148, -72.6785700106631)"
3,390874,NaN,NaN,860-296-2826,CT,AM27652,2020,HONDA,CRV,WHITE,55 TRUMBULL ST,5182021,227,"(41.76544374178968, -72.67653280963901)"
4,390705,CROSS COUNTRY AUTO,"585 WINDOSR ST. HARTFORD, CT 06120",860-296-2826,CT,AW19216,2015,INFINITI,Q50,GRAY,2 BECKET ST,5082021,1547,"(41.73478829173222, -72.68268585663728)"
6,390870,NaN,NaN,860-296-2826,CT,AP79798,2008,BMW,328,GRAY,217 WETHERSFIELD AV,5172021,1335,"(41.74979521483345, -72.67412888325924)"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
590,390765,CROSS COUNTRY AUTO,"585 WINDOSR ST. HARTFORD, CT 06120",860-296-2826,CT,AZ67191,2010,HONDA,ACCORD,GRAY,166 COLLINS ST,5102021,2125,"(41.77301969624251, -72.69027957677879)"
591,390767,CROSS COUNTRY AUTO,"585 WINDOSR ST. HARTFORD, CT 06120",860-296-2826,CT,AX41014,2020,TOYOTA,COROLLA,GRAY,37 HUNTINGTON ST,5102021,2203,"(41.771689641028985, -72.69195223539661)"
592,390766,CAPITOL TOWING,"181-211 WALNUT ST. HARTFORD, CT. 06120",860-293-2442,CT,9210XY,2012,HONDA,ACCORD,GRY,TOWER AV & WAVERLY ST,5102021,2135,"(90.0, -72.75)"
594,390864,NaN,NaN,860-677-7771,MA,3CX411,2009,NISSAN,ALTIMA,GRAY,270 LAUREL ST,5162021,1318,"(41.76643243554058, -72.69696318633216)"
596,390866,NaN,NaN,860-296-2826,MA,2GBK55,2014,AUDI,Q5,BLACK,5 MARY SHEPARD PL,5162021,1532,"(41.779264108968434, -72.67348009615753)"

In [42]:
towed_cars[(towed_cars['Vehicle_State']=='CT') 
           | (towed_cars['Color']=='Black')]

,TowNum,Tow_Firm,Tow_Firm_Address,Tow_Firm_Phone,Vehicle_State,Vehicle_Plate,Vehicle_Year,Make,Model,Color,Tow_From_Address,Date,Time,geom
0,390416,"CORONA'S AUTO PARTS,INC.",608 WETHERSFIELD AV. HARTFORD CT. 06114,860-296-5382,CT,AX31928,2003,MAZDA,TRIBUTE,BLUE,1 MAPLETON ST,4292021,1249,"(41.73928425961141, -72.68564556606026)"
1,390873,NaN,NaN,860-296-2826,CT,BA13154,2017,NISSAN,PATHFINDER,SILVER,66 TAYLOR DR,5182021,221,"(41.79532477861001, -72.67949086122226)"
2,390641,NaN,NaN,860-296-2826,CT,AT57018,2018,CHEVY,IMPALA,WHITE,300 ASYLUM ST,5062021,2348,"(41.76758525331148, -72.6785700106631)"
3,390874,NaN,NaN,860-296-2826,CT,AM27652,2020,HONDA,CRV,WHITE,55 TRUMBULL ST,5182021,227,"(41.76544374178968, -72.67653280963901)"
4,390705,CROSS COUNTRY AUTO,"585 WINDOSR ST. HARTFORD, CT 06120",860-296-2826,CT,AW19216,2015,INFINITI,Q50,GRAY,2 BECKET ST,5082021,1547,"(41.73478829173222, -72.68268585663728)"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
590,390765,CROSS COUNTRY AUTO,"585 WINDOSR ST. HARTFORD, CT 06120",860-296-2826,CT,AZ67191,2010,HONDA,ACCORD,GRAY,166 COLLINS ST,5102021,2125,"(41.77301969624251, -72.69027957677879)"
591,390767,CROSS COUNTRY AUTO,"585 WINDOSR ST. HARTFORD, CT 06120",860-296-2826,CT,AX41014,2020,TOYOTA,COROLLA,GRAY,37 HUNTINGTON ST,5102021,2203,"(41.771689641028985, -72.69195223539661)"
592,390766,CAPITOL TOWING,"181-211 WALNUT ST. HARTFORD, CT. 06120",860-293-2442,CT,9210XY,2012,HONDA,ACCORD,GRY,TOWER AV & WAVERLY ST,5102021,2135,"(90.0, -72.75)"
593,390801,CROSS COUNTRY AUTO,"585 WINDOSR ST. HARTFORD, CT 06120",860-296-2826,CT,429ZXH,1995,TOYOTA,COROLLA,BLUE,282 LAUREL ST,5122021,1542,"(41.766988656846046, -72.69696022167827)"
595,390865,CROSS COUNTRY AUTO,"585 WINDOSR ST. HARTFORD, CT 06120",860-296-2826,CT,AD68872,2004,HONDA,ACCORD,BLACK,5 MARY SHEPARD PL,5162021,1525,"(41.779264108968434, -72.67348009615753)"

In [43]:
towed_cars[~(towed_cars['Color']=='BLACK')]

,TowNum,Tow_Firm,Tow_Firm_Address,Tow_Firm_Phone,Vehicle_State,Vehicle_Plate,Vehicle_Year,Make,Model,Color,Tow_From_Address,Date,Time,geom
0,390416,"CORONA'S AUTO PARTS,INC.",608 WETHERSFIELD AV. HARTFORD CT. 06114,860-296-5382,CT,AX31928,2003,MAZDA,TRIBUTE,BLUE,1 MAPLETON ST,4292021,1249,"(41.73928425961141, -72.68564556606026)"
1,390873,NaN,NaN,860-296-2826,CT,BA13154,2017,NISSAN,PATHFINDER,SILVER,66 TAYLOR DR,5182021,221,"(41.79532477861001, -72.67949086122226)"
2,390641,NaN,NaN,860-296-2826,CT,AT57018,2018,CHEVY,IMPALA,WHITE,300 ASYLUM ST,5062021,2348,"(41.76758525331148, -72.6785700106631)"
3,390874,NaN,NaN,860-296-2826,CT,AM27652,2020,HONDA,CRV,WHITE,55 TRUMBULL ST,5182021,227,"(41.76544374178968, -72.67653280963901)"
4,390705,CROSS COUNTRY AUTO,"585 WINDOSR ST. HARTFORD, CT 06120",860-296-2826,CT,AW19216,2015,INFINITI,Q50,GRAY,2 BECKET ST,5082021,1547,"(41.73478829173222, -72.68268585663728)"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
590,390765,CROSS COUNTRY AUTO,"585 WINDOSR ST. HARTFORD, CT 06120",860-296-2826,CT,AZ67191,2010,HONDA,ACCORD,GRAY,166 COLLINS ST,5102021,2125,"(41.77301969624251, -72.69027957677879)"
591,390767,CROSS COUNTRY AUTO,"585 WINDOSR ST. HARTFORD, CT 06120",860-296-2826,CT,AX41014,2020,TOYOTA,COROLLA,GRAY,37 HUNTINGTON ST,5102021,2203,"(41.771689641028985, -72.69195223539661)"
592,390766,CAPITOL TOWING,"181-211 WALNUT ST. HARTFORD, CT. 06120",860-293-2442,CT,9210XY,2012,HONDA,ACCORD,GRY,TOWER AV & WAVERLY ST,5102021,2135,"(90.0, -72.75)"
593,390801,CROSS COUNTRY AUTO,"585 WINDOSR ST. HARTFORD, CT 06120",860-296-2826,CT,429ZXH,1995,TOYOTA,COROLLA,BLUE,282 LAUREL ST,5122021,1542,"(41.766988656846046, -72.69696022167827)"
594,390864,NaN,NaN,860-677-7771,MA,3CX411,2009,NISSAN,ALTIMA,GRAY,270 LAUREL ST,5162021,1318,"(41.76643243554058, -72.69696318633216)"

# Multiindexing in a DataFrame
Multiindexing also called as heirarchial indexing defines various levels of indices,which lets you effectively store and manipulate higher dimension data in a 2-dimensional tabular structure

In [44]:
avocados=pd.read_csv('C:/Destination/avocado.csv')
avocados

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,27-12-2015,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,20-12-2015,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,13-12-2015,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,06-12-2015,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,29-11-2015,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18244,7,04-02-2018,1.63,17074.83,2046.96,1529.20,0.00,13498.67,13066.82,431.85,0.0,organic,2018,WestTexNewMexico
18245,8,28-01-2018,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.0,organic,2018,WestTexNewMexico
18246,9,21-01-2018,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.0,organic,2018,WestTexNewMexico
18247,10,14-01-2018,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,07-01-2018,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

In [45]:
avocados['region'].unique()

array(['Albany', 'Atlanta', 'BaltimoreWashington', 'Boise', 'Boston',
       'BuffaloRochester', 'California', 'Charlotte', 'Chicago',
       'CincinnatiDayton', 'Columbus', 'DallasFtWorth', 'Denver',
       'Detroit', 'GrandRapids', 'GreatLakes', 'HarrisburgScranton',
       'HartfordSpringfield', 'Houston', 'Indianapolis', 'Jacksonville',
       'LasVegas', 'LosAngeles', 'Louisville', 'MiamiFtLauderdale',
       'Midsouth', 'Nashville', 'NewOrleansMobile', 'NewYork',
       'Northeast', 'NorthernNewEngland', 'Orlando', 'Philadelphia',
       'PhoenixTucson', 'Pittsburgh', 'Plains', 'Portland',
       'RaleighGreensboro', 'RichmondNorfolk', 'Roanoke', 'Sacramento',
       'SanDiego', 'SanFrancisco', 'Seattle', 'SouthCarolina',
       'SouthCentral', 'Southeast', 'Spokane', 'StLouis', 'Syracuse',
       'Tampa', 'TotalUS', 'West', 'WestTexNewMexico'], dtype=object)

In [46]:
avocados_TotalUS=avocados[(avocados['region']=='TotalUS')
                         &(avocados['Date']>'2018-01-01') ]

In [47]:
avocados_TotalUS=avocados_TotalUS.sort_values(['Date'])
avocados_TotalUS

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
9099,9,21-01-2018,1.08,42939821.55,14218843.83,13929702.12,928815.12,13862460.48,9866218.28,3789722.90,206519.30,conventional,2018,TotalUS
18222,9,21-01-2018,1.63,1283987.65,108705.28,259172.13,1490.02,914409.26,710654.40,203526.59,228.27,organic,2018,TotalUS
5504,44,21-02-2016,0.94,32804733.22,10015825.13,12003751.56,1375260.47,9409896.06,7213492.61,2150749.43,45654.02,conventional,2016,TotalUS
14629,44,21-02-2016,1.45,738856.92,104135.94,281188.89,8629.03,344903.06,223281.18,121621.88,0.00,organic,2016,TotalUS
8351,32,21-05-2017,1.26,34397651.15,12120948.70,10213231.95,621603.57,11441866.93,8508442.17,2718685.22,214739.54,conventional,2017,TotalUS
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
11808,30,31-05-2015,1.58,716942.71,205250.19,333300.63,6835.09,171556.80,117664.54,53892.26,0.00,organic,2015,TotalUS
5481,21,31-07-2016,1.23,31201590.22,10168972.37,10423957.83,783937.09,9824722.93,8193011.02,1431744.52,199967.39,conventional,2016,TotalUS
14606,21,31-07-2016,1.58,946087.81,156417.33,328942.12,9035.27,451693.09,320652.23,131040.86,0.00,organic,2016,TotalUS
8319,0,31-12-2017,0.98,38267341.61,13109617.49,13197460.59,644837.54,11315425.99,8092355.20,3098373.91,124696.88,conventional,2017,TotalUS
17444,0,31-12-2017,1.52,1243940.09,120545.76,248123.56,1279.48,873874.64,723304.51,150460.36,109.77,organic,2017,TotalUS

In [48]:
avocados_pivot=avocados_TotalUS.pivot(index='Date',
                                      columns='type',
                                      values='AveragePrice')
avocados_pivot                                 #The Combination of index and columns must be unique to generate a pivot table

type        conventional  organic
Date
21-01-2018          1.08     1.63
21-02-2016          0.94     1.45
21-05-2017          1.26     1.71
21-06-2015          1.02     1.66
21-08-2016          1.10     1.51
22-01-2017          0.94     1.37
22-02-2015          1.02     1.51
22-03-2015          1.01     1.49
22-05-2016          0.93     1.36
22-10-2017          1.44     1.82
22-11-2015          0.96     1.49
23-04-2017          1.18     1.61
23-07-2017          1.31     1.76
23-08-2015          1.08     1.72
23-10-2016          1.34     1.63
24-01-2016          0.95     1.41
24-04-2016          0.87     1.25
24-05-2015          1.04     1.59
24-07-2016          1.20     1.65
24-09-2017          1.62     1.94
24-12-2017          1.18     1.64
25-01-2015          1.04     1.53
25-02-2018          1.06     1.57
25-03-2018          1.03     1.55
25-06-2017          1.17     1.77
25-09-2016          1.22     1.69
25-10-2015          1.04     1.62
25-12-2016          1.00     1.34
26-02-2017          0.99     1.21
26-03-2017          1.24     1.29
26-04-2015          1.07     1.45
26-06-2016          1.04     1.50
26-07-2015          1.07     1.00
26-11-2017          1.24     1.72
27-03-2016          0.94     1.44
27-08-2017          1.47     2.09
27-09-2015          1.03     1.75
27-11-2016          1.21     1.64
27-12-2015          0.95     1.52
28-01-2018          1.09     1.61
28-02-2016          0.91     1.44
28-05-2017          1.28     1.69
28-06-2015          1.06     1.64
28-08-2016          1.09     1.49
29-01-2017          0.96     1.43
29-03-2015          1.04     1.60
29-05-2016          0.94     1.41
29-10-2017          1.29     1.84
29-11-2015          0.99     1.50
30-04-2017          1.18     1.68
30-07-2017          1.32     1.78
30-08-2015          1.07     1.66
30-10-2016          1.43     1.93
31-01-2016          0.93     1.43
31-05-2015          1.03     1.58
31-07-2016          1.23     1.58
31-12-2017          0.98     1.52

# Reshape Dataframes using Melt and Stack operations

In [49]:
avocados=pd.read_csv('C:/Destination/avocado.csv',index_col=['region','Date'])
avcados=avocados.sort_index()
avocados

                             Unnamed: 0  AveragePrice  Total Volume     4046  \
region           Date
Albany           27-12-2015           0          1.33      64236.62  1036.74
                 20-12-2015           1          1.35      54876.98   674.28
                 13-12-2015           2          0.93     118220.22   794.70
                 06-12-2015           3          1.08      78992.15  1132.00
                 29-11-2015           4          1.28      51039.60   941.48
...                                 ...           ...           ...      ...
WestTexNewMexico 04-02-2018           7          1.63      17074.83  2046.96
                 28-01-2018           8          1.71      13888.04  1191.70
                 21-01-2018           9          1.87      13766.76  1191.92
                 14-01-2018          10          1.93      16205.22  1527.63
                 07-01-2018          11          1.62      17489.58  2894.77

                                  4225    4770  Total Bags  Small Bags  \
region           Date
Albany           27-12-2015   54454.85   48.16     8696.87     8603.62
                 20-12-2015   44638.81   58.33     9505.56     9408.07
                 13-12-2015  109149.67  130.50     8145.35     8042.21
                 06-12-2015   71976.41   72.58     5811.16     5677.40
                 29-11-2015   43838.39   75.78     6183.95     5986.26
...                                ...     ...         ...         ...
WestTexNewMexico 04-02-2018    1529.20    0.00    13498.67    13066.82
                 28-01-2018    3431.50    0.00     9264.84     8940.04
                 21-01-2018    2452.79  727.94     9394.11     9351.80
                 14-01-2018    2981.04  727.01    10969.54    10919.54
                 07-01-2018    2356.13  224.53    12014.15    11988.14

                             Large Bags  XLarge Bags          type  year
region           Date
Albany           27-12-2015       93.25          0.0  conventional  2015
                 20-12-2015       97.49          0.0  conventional  2015
                 13-12-2015      103.14          0.0  conventional  2015
                 06-12-2015      133.76          0.0  conventional  2015
                 29-11-2015      197.69          0.0  conventional  2015
...                                 ...          ...           ...   ...
WestTexNewMexico 04-02-2018      431.85          0.0       organic  2018
                 28-01-2018      324.80          0.0       organic  2018
                 21-01-2018       42.31          0.0       organic  2018
                 14-01-2018       50.00          0.0       organic  2018
                 07-01-2018       26.01          0.0       organic  2018

[18249 rows x 12 columns]

In [50]:
avocados=avocados[avocados['type']=='organic']
avocados

                             Unnamed: 0  AveragePrice  Total Volume     4046  \
region           Date
Albany           27-12-2015           0          1.83        989.55     8.16
                 20-12-2015           1          1.89       1163.03    30.24
                 13-12-2015           2          1.85        995.96    10.44
                 06-12-2015           3          1.84       1158.42    90.29
                 29-11-2015           4          1.94        831.69     0.00
...                                 ...           ...           ...      ...
WestTexNewMexico 04-02-2018           7          1.63      17074.83  2046.96
                 28-01-2018           8          1.71      13888.04  1191.70
                 21-01-2018           9          1.87      13766.76  1191.92
                 14-01-2018          10          1.93      16205.22  1527.63
                 07-01-2018          11          1.62      17489.58  2894.77

                                4225    4770  Total Bags  Small Bags  \
region           Date
Albany           27-12-2015    88.59    0.00      892.80      892.80
                 20-12-2015   172.14    0.00      960.65      960.65
                 13-12-2015   178.70    0.00      806.82      806.82
                 06-12-2015   104.18    0.00      963.95      948.52
                 29-11-2015    94.73    0.00      736.96      736.96
...                              ...     ...         ...         ...
WestTexNewMexico 04-02-2018  1529.20    0.00    13498.67    13066.82
                 28-01-2018  3431.50    0.00     9264.84     8940.04
                 21-01-2018  2452.79  727.94     9394.11     9351.80
                 14-01-2018  2981.04  727.01    10969.54    10919.54
                 07-01-2018  2356.13  224.53    12014.15    11988.14

                             Large Bags  XLarge Bags     type  year
region           Date
Albany           27-12-2015        0.00          0.0  organic  2015
                 20-12-2015        0.00          0.0  organic  2015
                 13-12-2015        0.00          0.0  organic  2015
                 06-12-2015       15.43          0.0  organic  2015
                 29-11-2015        0.00          0.0  organic  2015
...                                 ...          ...      ...   ...
WestTexNewMexico 04-02-2018      431.85          0.0  organic  2018
                 28-01-2018      324.80          0.0  organic  2018
                 21-01-2018       42.31          0.0  organic  2018
                 14-01-2018       50.00          0.0  organic  2018
                 07-01-2018       26.01          0.0  organic  2018

[9123 rows x 12 columns]

In [51]:
avocados=avocados.loc[(avocados.index.get_level_values('Date') > '2018-03-01')]
avocados

                             Unnamed: 0  AveragePrice  Total Volume      4046  \
region           Date
Albany           27-12-2015           0          1.83        989.55      8.16
                 29-11-2015           4          1.94        831.69      0.00
                 22-11-2015           5          1.94        858.83     13.84
                 25-10-2015           9          1.83       1161.90     49.27
                 27-09-2015          13          1.98        814.13     13.79
...                                 ...           ...           ...       ...
West             21-01-2018           9          1.83     189317.99  27049.44
WestTexNewMexico 25-03-2018           0          1.62      15303.40   2325.30
                 25-02-2018           4          1.57      18421.24   1974.26
                 28-01-2018           8          1.71      13888.04   1191.70
                 21-01-2018           9          1.87      13766.76   1191.92

                                 4225    4770  Total Bags  Small Bags  \
region           Date
Albany           27-12-2015     88.59    0.00      892.80      892.80
                 29-11-2015     94.73    0.00      736.96      736.96
                 22-11-2015     84.18    0.00      760.81      755.69
                 25-10-2015    148.96    0.00      963.67      963.67
                 27-09-2015    140.23    0.00      660.11      660.11
...                               ...     ...         ...         ...
West             21-01-2018  33561.32  439.47   128267.76    76091.99
WestTexNewMexico 25-03-2018   2171.66    0.00    10806.44    10569.80
                 25-02-2018   2482.65    0.00    13964.33    13698.27
                 28-01-2018   3431.50    0.00     9264.84     8940.04
                 21-01-2018   2452.79  727.94     9394.11     9351.80

                             Large Bags  XLarge Bags     type  year
region           Date
Albany           27-12-2015        0.00         0.00  organic  2015
                 29-11-2015        0.00         0.00  organic  2015
                 22-11-2015        5.12         0.00  organic  2015
                 25-10-2015        0.00         0.00  organic  2015
                 27-09-2015        0.00         0.00  organic  2015
...                                 ...          ...      ...   ...
West             21-01-2018    51947.50       228.27  organic  2018
WestTexNewMexico 25-03-2018      236.64         0.00  organic  2018
                 25-02-2018      266.06         0.00  organic  2018
                 28-01-2018      324.80         0.00  organic  2018
                 21-01-2018       42.31         0.00  organic  2018

[3077 rows x 12 columns]

In [52]:
avocados.index

MultiIndex([(          'Albany', '27-12-2015'),
            (          'Albany', '29-11-2015'),
            (          'Albany', '22-11-2015'),
            (          'Albany', '25-10-2015'),
            (          'Albany', '27-09-2015'),
            (          'Albany', '30-08-2015'),
            (          'Albany', '23-08-2015'),
            (          'Albany', '26-07-2015'),
            (          'Albany', '28-06-2015'),
            (          'Albany', '21-06-2015'),
            ...
            (         'TotalUS', '28-01-2018'),
            (         'TotalUS', '21-01-2018'),
            (            'West', '25-03-2018'),
            (            'West', '25-02-2018'),
            (            'West', '28-01-2018'),
            (            'West', '21-01-2018'),
            ('WestTexNewMexico', '25-03-2018'),
            ('WestTexNewMexico', '25-02-2018'),
            ('WestTexNewMexico', '28-01-2018'),
            ('WestTexNewMexico', '21-01-2018')],
           names=['region', 'Date'], length=3077)

In [53]:
avocados_pivot

type        conventional  organic
Date
21-01-2018          1.08     1.63
21-02-2016          0.94     1.45
21-05-2017          1.26     1.71
21-06-2015          1.02     1.66
21-08-2016          1.10     1.51
22-01-2017          0.94     1.37
22-02-2015          1.02     1.51
22-03-2015          1.01     1.49
22-05-2016          0.93     1.36
22-10-2017          1.44     1.82
22-11-2015          0.96     1.49
23-04-2017          1.18     1.61
23-07-2017          1.31     1.76
23-08-2015          1.08     1.72
23-10-2016          1.34     1.63
24-01-2016          0.95     1.41
24-04-2016          0.87     1.25
24-05-2015          1.04     1.59
24-07-2016          1.20     1.65
24-09-2017          1.62     1.94
24-12-2017          1.18     1.64
25-01-2015          1.04     1.53
25-02-2018          1.06     1.57
25-03-2018          1.03     1.55
25-06-2017          1.17     1.77
25-09-2016          1.22     1.69
25-10-2015          1.04     1.62
25-12-2016          1.00     1.34
26-02-2017          0.99     1.21
26-03-2017          1.24     1.29
26-04-2015          1.07     1.45
26-06-2016          1.04     1.50
26-07-2015          1.07     1.00
26-11-2017          1.24     1.72
27-03-2016          0.94     1.44
27-08-2017          1.47     2.09
27-09-2015          1.03     1.75
27-11-2016          1.21     1.64
27-12-2015          0.95     1.52
28-01-2018          1.09     1.61
28-02-2016          0.91     1.44
28-05-2017          1.28     1.69
28-06-2015          1.06     1.64
28-08-2016          1.09     1.49
29-01-2017          0.96     1.43
29-03-2015          1.04     1.60
29-05-2016          0.94     1.41
29-10-2017          1.29     1.84
29-11-2015          0.99     1.50
30-04-2017          1.18     1.68
30-07-2017          1.32     1.78
30-08-2015          1.07     1.66
30-10-2016          1.43     1.93
31-01-2016          0.93     1.43
31-05-2015          1.03     1.58
31-07-2016          1.23     1.58
31-12-2017          0.98     1.52

In [54]:
avocados_stack=avocados_pivot.stack()
avocados_stack

Date        type
21-01-2018  conventional    1.08
            organic         1.63
21-02-2016  conventional    0.94
            organic         1.45
21-05-2017  conventional    1.26
                            ...
31-05-2015  organic         1.58
31-07-2016  conventional    1.23
            organic         1.58
31-12-2017  conventional    0.98
            organic         1.52
Length: 114, dtype: float64

In [55]:
avocados_unstack=avocados_stack.unstack()
avocados_unstack

type        conventional  organic
Date
21-01-2018          1.08     1.63
21-02-2016          0.94     1.45
21-05-2017          1.26     1.71
21-06-2015          1.02     1.66
21-08-2016          1.10     1.51
22-01-2017          0.94     1.37
22-02-2015          1.02     1.51
22-03-2015          1.01     1.49
22-05-2016          0.93     1.36
22-10-2017          1.44     1.82
22-11-2015          0.96     1.49
23-04-2017          1.18     1.61
23-07-2017          1.31     1.76
23-08-2015          1.08     1.72
23-10-2016          1.34     1.63
24-01-2016          0.95     1.41
24-04-2016          0.87     1.25
24-05-2015          1.04     1.59
24-07-2016          1.20     1.65
24-09-2017          1.62     1.94
24-12-2017          1.18     1.64
25-01-2015          1.04     1.53
25-02-2018          1.06     1.57
25-03-2018          1.03     1.55
25-06-2017          1.17     1.77
25-09-2016          1.22     1.69
25-10-2015          1.04     1.62
25-12-2016          1.00     1.34
26-02-2017          0.99     1.21
26-03-2017          1.24     1.29
26-04-2015          1.07     1.45
26-06-2016          1.04     1.50
26-07-2015          1.07     1.00
26-11-2017          1.24     1.72
27-03-2016          0.94     1.44
27-08-2017          1.47     2.09
27-09-2015          1.03     1.75
27-11-2016          1.21     1.64
27-12-2015          0.95     1.52
28-01-2018          1.09     1.61
28-02-2016          0.91     1.44
28-05-2017          1.28     1.69
28-06-2015          1.06     1.64
28-08-2016          1.09     1.49
29-01-2017          0.96     1.43
29-03-2015          1.04     1.60
29-05-2016          0.94     1.41
29-10-2017          1.29     1.84
29-11-2015          0.99     1.50
30-04-2017          1.18     1.68
30-07-2017          1.32     1.78
30-08-2015          1.07     1.66
30-10-2016          1.43     1.93
31-01-2016          0.93     1.43
31-05-2015          1.03     1.58
31-07-2016          1.23     1.58
31-12-2017          0.98     1.52

In [56]:
avocados_multiindex_stack=avocados.stack()
avocados_multiindex_stack

region            Date
Albany            27-12-2015  Unnamed: 0            0
                              AveragePrice       1.83
                              Total Volume     989.55
                              4046               8.16
                              4225              88.59
                                               ...
WestTexNewMexico  21-01-2018  Small Bags       9351.8
                              Large Bags        42.31
                              XLarge Bags           0
                              type            organic
                              year               2018
Length: 36924, dtype: object

In [73]:
avocados=pd.read_csv('C:/Destination/avocado.csv')
avocados=avocados[avocados['Date']>'2018-03-01']
avocados

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,27-12-2015,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.00,conventional,2015,Albany
4,4,29-11-2015,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.00,conventional,2015,Albany
5,5,22-11-2015,1.26,55979.78,1184.27,48067.99,43.61,6683.91,6556.47,127.44,0.00,conventional,2015,Albany
9,9,25-10-2015,1.07,74338.76,842.40,64757.44,113.00,8625.92,8061.47,564.45,0.00,conventional,2015,Albany
13,13,27-09-2015,0.99,106803.39,1204.88,99409.21,154.84,6034.46,5888.87,145.59,0.00,conventional,2015,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18234,9,21-01-2018,1.83,189317.99,27049.44,33561.32,439.47,128267.76,76091.99,51947.50,228.27,organic,2018,West
18237,0,25-03-2018,1.62,15303.40,2325.30,2171.66,0.00,10806.44,10569.80,236.64,0.00,organic,2018,WestTexNewMexico
18241,4,25-02-2018,1.57,18421.24,1974.26,2482.65,0.00,13964.33,13698.27,266.06,0.00,organic,2018,WestTexNewMexico
18245,8,28-01-2018,1.71,13888.04,1191.70,3431.50,0.00,9264.84,8940.04,324.80,0.00,organic,2018,WestTexNewMexico
18246,9,21-01-2018,1.87,13766.76,1191.92,2452.79,727.94,9394.11,9351.80,42.31,0.00,organic,2018,WestTexNewMexico

In [58]:
avocados_melted=avocados.melt(id_vars=['region','type','Date'],
                             value_vars=['AveragePrice','Total Volume'])
avocados_melted

                 region          type        Date      variable      value
0                Albany  conventional  27-12-2015  AveragePrice       1.33
1                Albany  conventional  29-11-2015  AveragePrice       1.28
2                Albany  conventional  22-11-2015  AveragePrice       1.26
3                Albany  conventional  25-10-2015  AveragePrice       1.07
4                Albany  conventional  27-09-2015  AveragePrice       0.99
...                 ...           ...         ...           ...        ...
12305              West       organic  21-01-2018  Total Volume  189317.99
12306  WestTexNewMexico       organic  25-03-2018  Total Volume   15303.40
12307  WestTexNewMexico       organic  25-02-2018  Total Volume   18421.24
12308  WestTexNewMexico       organic  28-01-2018  Total Volume   13888.04
12309  WestTexNewMexico       organic  21-01-2018  Total Volume   13766.76

[12310 rows x 5 columns]

In [64]:
l=[0,1,2,3,4,5,6,7,8,9,10]
x=pd.Series(l)

In [65]:
x[[0,7,10]].values

array([ 0,  7, 10], dtype=int64)

In [66]:
depts=pd.DataFrame([np.arange(50)],[np.arange(50)])

In [67]:
depts[5].unique()

array([5], dtype=int64)

In [72]:
depts.loc[[0,7,10],:]

,0,1,2,3,4,5,6,7,8,9,...,40,41,42,43,44,45,46,47,48,49
0,0,1,2,3,4,5,6,7,8,9,...,40,41,42,43,44,45,46,47,48,49
7,0,1,2,3,4,5,6,7,8,9,...,40,41,42,43,44,45,46,47,48,49
10,0,1,2,3,4,5,6,7,8,9,...,40,41,42,43,44,45,46,47,48,49